{
  "intents": [
    {
      "intent": "small_talk",
      "patterns": [
        "Hi",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "How are things?",
        "Howdy!",
        "hey",
        "Yo!",
        "Bye",
        "See you later",
        "Goodbye",
        " good bye",
        "sayonara",
        "see you",
        "byeee",
        "ciao",
        "hasta la vista",
        "what can you do?",
        "Hi I need help",
        "what's new?",
        "whats up?",
        "what's new",
        "how you hanging?",
        "hi",
        "how can you help me?"
      ],
      "responses": [
        "Hello, thanks for visiting",
        "Good to see you again",
        "Hi there, how can I help?"
      ]
    },
    {
      "intent": "trial",
      "patterns": [
        "How to add user in Calypso?",
		"Show me status report for 1234",
        "Tell me about my task status",
        "Status of task 2222",
        "Do you know about my task status",
        "Give me my Task status",
        "Help me with my task 2222 status",
        "Do you know how to add user in Calypso?",
        "Tell me how to add user in Calypso?",
        "Help me to add user in Calypso",
        "How can I add user in Calypso?",
        "Help me in adding user in Calypso?",
        "How to mirror existing user?",
        "Tell me how to mirror existing user?",
        "Do you know anything about how to mirror existing user?",
        "Do you have any idea related to mirror existing user?",
        "How to set a new user similar to existing user?",
        "How to set access permissions for new user similar to existing user?",
        "What is a Group?",
		"Show me task type for 1234",
        "Tell me about my task type",
        "Task type of 12869",
        "Do you know about my task type",
		"Hey Bot, Show me some Schedule Tasks",
        "Give me my Task type for",
        "Help me with my task 2222 type",
		"Show me task parent for 1234",
        "Tell me about my task type",
        "Task parent of 12869",
        "Do you know parent of task",
        "parent of task 2389",
        "Show me something about SOP",
        "Tell me something about SOP",
        "SOP",
        "Do you know anything about SOP",
        "Give me information about SOP",
        "Give me information about SOP",
        "show parent of task 7675",
        "Do you know what is a Group?",
        "What do know about group?",
        "Tell me something about group.",
        "What is a Group in access permissions?",
        "Do you know what is a group in access permissions?",
        "Do you know anything about group in access permissions?",
        "Tell me something about group in access permissions",
        "Any idea about group in access permissions?",
        "Do you have any idea about group in access permissions",
        "What to do if a user is locked?",
        "Do you know what to do if a user is locked?",
        "What do know about locked user?",
        "Tell me what to do if a user is locked?",
        "Do you know any process to do if a user is locked?",
        "process to do if a user is locked?",
        "Tell me what can i do if person is locked?",
        "Any idea about process to do if person is locked?",
         "How to reset password for a user?",
        "Do you know how to reset password for a user?",
        "What do know about resetting password for a user?",
        "Tell me how to How to reset password for a user?",
        "Do you know any process to How to reset password for a user?",
        "process to reset password for a user?",
        "Tell me how to reset password for a user?",
        "Any idea about process to reset password for a user?",
        "Where can I find existing trades in Calypso ?",
        "Do you know where can I find existing trades in Calypso ?",
        "Tell me where can I find existing trades in Calypso?",
        "Do you know where can I find existing trades in Calypso ?",
        "process to find existing trades in Calypso",
        "Any idea about process to find existing trades in Calypso?",
        "what is pricing sheet?",
        "Do you know what is pricing sheet?",
        "Tell me what is pricing sheet?",
        "Do you know anything about pricing sheet?",
        "Tell me something about pricing sheet?",
        "Hey Buddy, Show me something on Failed Tasks",
        "Hey Buddy, Show me something on successful Tasks",
        "Hey Buddy, Show me something on untriggred Tasks",
        "Hey Buddy, Show me something on tasks finished with errors",
        "Any idea about pricing sheet?",
        "what is pricing grid?",
        "Do you know what is pricing grid?",
        "Tell me what is pricing grid?",
        "Do you know anything about pricing grid?",
        "Tell me something about pricing grid?",
        "Any idea about pricing grid?",
        "what is risk Config?",
        "Do you know what is risk Config?",
        "Tell me what is risk Config?",
        "Do you know anything about risk Config?",
        "Tell me something about risk Config?",
        "Any idea about risk Config?",
         "what is calypso workstation?",
        "Do you know what is calypso workstation?",
        "Tell me what is calypso workstation?",
        "Do you know anything about calypso workstation?",
        "Tell me something about calypso workstation?",
        "Any idea about calypso workstation?",
         "what is an ob-demand analysis?",
        "Do you know what is an ob-demand analysis?",
        "Tell me what is an ob-demand analysis?",
        "Do you know anything about an ob-demand analysis?",
        "Tell me something about an ob-demand analysis?",
        "Any idea about an ob-demand analysis?",
        "How to load a particular trade ID?",
        "Do you know how to load a particular trade ID??",
        "Tell me how to load a particular trade ID?",
        "Do you know anything about loading a particular trade ID?",
        "Tell me something about loading a particular trade ID",
        "Any idea about loading a particular trade ID?",
        "Process for loading a particular trade ID",
        "How to load a particular message?",
        "How to load a particular message directly in Calypso?",
        "Do you know how to load a particular message?",
        "Do you know how to load a particular message directly in Calypso?",
        "Tell me how to load a particular message?",
        "Tell me how to load a particular message directly in Calypso?",
        "Do you know anything about loading a particular message?",
        "Do you know anything about loading a particular message directly in Calypso?",
        "Tell me something about loading a particular message",
        "Tell me something about loading a particular message directly in Calypso",
        "Any idea about loading a particular message?",
        "Any idea about loading a particular message directly in Calypso?",
        "Process for loading a particular message",
        "Process for loading a particular message directly in Calypso",
        "How to load a particular posting?",
        "How to load a particular posting directly in Calypso?",
        "Do you know how to load a particular posting?",
        "Do you know how to load a particular posting directly in Calypso?",
        "Tell me how to load a particular posting?",
        "Tell me how to load a particular posting directly in Calypso?",
        "Do you know anything about loading a particular posting?",
        "Do you know anything about loading a particular posting directly in Calypso?",
        "Tell me something about loading a particular posting",
        "Tell me something about loading a particular posting directly in Calypso",
        "Any idea about loading a particular posting?",
        "Any idea about loading a particular posting directly in Calypso?",
        "Process for loading a particular posting",
        "Process for loading a particular posting directly in Calypso",
        "How to load a particular transfer?",
        "How to load a particular transfer directly in Calypso?",
        "Do you know how to load a particular transfer?",
        "Do you know how to load a particular transfer directly in Calypso?",
        "Tell me how to load a particular transfer?",
        "Tell me how to load a particular transfer directly in Calypso?",
        "Do you know anything about loading a particular transfer?",
        "Do you know anything about loading a particular transfer directly in Calypso?",
        "Tell me something about loading a particular transfer",
        "Tell me something about loading a particular transfer directly in Calypso",
        "Any idea about loading a particular transfer?",
        "Any idea about loading a particular transfer directly in Calypso?",
        "Process for loading a particular transfer",
        "Process for loading a particular transfer directly in Calypso",
        "what is data Authorization?",
        "Do you know what is data Authorization?",
        "Tell me what is data Authorization?",
        "Do you know anything about data Authorization?",
        "Tell me something about data Authorization?",
        "Any idea about data Authorization?",
        "How to check which product types are getting booked in Calypso?",
        "Do you know how to check which product types are getting booked in Calypso?",
        "Tell me how to check which product types are getting booked in Calypso?",
        "Do you know anything about how to check which product types are getting booked in Calypso?",
        "Tell me something about how to check which product types are getting booked in Calypso?",
        "Any idea about how to check which product types are getting booked in Calypso?",
        "How to check which trades got booked on particular date?",
        "Do you know which trades got booked on particular date?",
        "Tell me which trades got booked on particular date?",
        "Do you know anything about which trades got booked on particular date?",
        "Tell me something about which trades got booked on particular date?",
        "Any idea about which trades got booked on particular date?",
        "Give trades got booked on particular date",
        "Give me trades got booked on particular date",
        "Where are books defined in Calypso?",
        "Do you know where are books defined in Calypso?",
        "Tell me where are books defined in Calypso?",
        "Do you know anything about where are books defined in Calypso?",
        "Tell me something about where are books defined in Calypso?",
        "Any idea about where are books defined in Calypso?",
        "What is a trading book?",
        "trading book",
        "Do you know what is a trading book?",
        "Tell me a what is trading book?",
        "Do you know anything about what is a trading book?",
        "Tell me something about what is a trading book?",
        "Any idea about what is a trading book?",
        "What is an accounting book?",
        "What is an accounting link?",
        "accounting book",
        "accounting link",
        "Do you know what is an accounting book?",
        "Tell me what is an accounting book?",
        "Do you know anything about what is an accounting book?",
        "Tell me something about what is accounting book?",
        "Any idea about what is accounting book?",
        "Do you know what is an accounting link?",
        "Tell me what is an accounting link?",
        "Do you know anything about what is an accounting link?",
        "Tell me something about what is accounting link?",
        "Any idea about what is accounting link?",
        "What is an accounting event?",
        "accounting event",
        "Do you know what is an accounting event?",
        "Tell me what is an accounting event?",
        "Do you know anything about what is an accounting event?",
        "Tell me something about what is accounting event?",
        "Any idea about what is accounting event?",
         "Where is CounterParty used on Trade defined in Calypso?",
        "Do you know Where is CounterParty used on Trade defined in Calypso?",
        "Tell me Where is CounterParty used on Trade defined in Calypso?",
        "Do you know anything about Where is CounterParty used on Trade defined in Calypso?",
        "Tell me something about Where is CounterParty used on Trade defined in Calypso",
        "Any idea about Where is CounterParty used on Trade defined in Calypso",
        "What is an accounting book?",
        "What is an accounting link?",
        "accounting rule",
        "Do you know what is an accounting book?",
        "Tell me what is an accounting book?",
        "Do you know anything about what is an accounting book?",
        "Tell me something about what is accounting book?",
        "Any idea about what is accounting book?",
        "What is a static data filter?",
        "static data filter",
        "Do you know what is a static data filter?",
        "Tell me what is a static data filter?",
        "Do you know anything about what is a static data filter?",
        "Tell me something about what is a static data filter?",
        "Any idea about what is a static data filter?",
        "What is a trade filter?",
        "trade filter",
        "Do you know what is a trade filter?",
        "Tell me what is a trade filter?",
        "Do you know anything about what is a trade filter?",
        "Tell me something about what is a trade filter?",
        "Any idea about what is a trade filter?",
        "What is a filterset?",
        "filterset",
        "Do you know what is a filterset?",
        "Tell me what is a filterset?",
        "Do you know anything about what is a filterset?",
        "Tell me something about what is a filterset?",
        "Any idea about what is a filterset?",
         "What is a legal entity?",
        "legal entity",
        "Do you know what is a legal entity?",
        "Tell me what is a legal entity?",
        "Do you know anything about what is a legal entity?",
        "Tell me something about what is a legal entity?",
        "Any idea about what is a legal entity?",
        "What is a Message Set-up?",
        "Message Set-up",
        "Do you know what is a Message Set-up?",
        "Tell me what is a Message Set-up?",
        "Do you know anything about what is a Message Set-up?",
        "Tell me something about what is a Message Set-up?",
        "Any idea about what is a Message Set-up?",
        "What is a message sender?",
        "message sender",
        "Do you know what is a message sender?",
        "Tell me what is a message sender?",
        "Do you know anything about what is a message sender?",
        "Tell me something about what is a message sender?",
        "Any idea about what is a message sender?",
        "What is a settlement delivery instruction?",
        "settlement delivery instruction",
        "SDI",
        "What is SDI?",
        "Do you know about SDI?",
        "Tell me what is a settlement delivery instruction?",
        "Tell me what is a SDI?",
        "Do you know anything about what is a SDI?",
        "Tell me something about what is a settlement delivery instruction?",
        "Any idea about settlement delivery instruction?",
        "Any idea about SDI?",
        "What is a workflow?",
        "workflow",
        "Do you know about workflow?",
        "Tell me what is a workflow?",
        "Do you know anything about what is a workflow?",
        "Tell me something about what is a workflow?",
        "Any idea about workflow?",
         "What is a domain values?",
        "domain values",
        "Do you know about domain values?",
        "Tell me what is a domain values?",
        "Do you know anything about what is a domain values?",
        "Tell me something about what is a domain values?",
        "Any idea about domain values?",
        "What is a scheduled task?",
        "scheduled task",
        "Do you know about scheduled task?",
        "Tell me what is a scheduled task?",
        "Do you know anything about what is a scheduled task?",
        "Tell me something about what is a scheduled task?",
        "Any idea about scheduled task?",
        "where is a scheduled task window?",
        "scheduled task window",
        "Do you know where is scheduled task window?",
        "Tell me where is a scheduled task window?",
        "Do you know anything about where is a scheduled task window?",
        "Tell me something about where is a scheduled task window?",
        "Any idea where is scheduled task window?",
         "Is there a cost associated with each user?",
        "Do you know is there a cost associated with each user?",
        "Tell me where is there a cost associated with each user?",
        "Do you know anything about cost associated with each user",
        "Tell me something about cost associated with each user",
        "Any idea about cost associated with each user",
        "How do I raise a support ticket?",
        "Do you know how do I raise a support ticket?",
        "Tell me how do I raise a support ticket?",
        "Do you know anything about how do I raise a support ticket",
        "Tell me something about how do I raise a support ticket",
        "Any idea how do I raise a support ticket?",
        "How do I request for an enhancement?",
        "Do you know how do I request for an enhancement?",
        "Tell me how do I request for an enhancement?",
        "Do you know anything about how do I request for an enhancement?",
        "Tell me something about how do I request for an enhancement?",
        "Any idea how do I request for an enhancement?",
         "Underlying technology used for Calypso",
        "Do you know technology used for Calypso?",
        "Tell me technology used for Calypso?",
        "Do you know anything about technology used for Calypso?",
        "Tell me something about technology used for Calypso?",
        "Any idea technology used for Calypso?",
        "Process to add trading Book",
        "Do you know process to add trading Book?",
        "Tell me process to add trading Book?",
        "Do you know anything about Process to add trading Book?",
        "Tell me something about Process to add trading Book?",
        "Any idea Process to add trading Book?",
        "Process to get market data",
        "Do you know process to get market data?",
        "Tell me process to get market data?",
        "Do you know anything about Process to get market data?",
        "Tell me something about Process to get market data?",
        "Any idea Process to get market data?",
        "What are the software requirements while installing Calypso?",
        "Do you know What are the software requirements while installing Calypso?",
        "Tell me What are the software requirements while installing Calypso?",
        "Do you know anything about What are the software requirements while installing Calypso?",
        "Tell me something about What are the software requirements while installing Calypso?",
        "Any idea What are the software requirements while installing Calypso?",
        "What is jnlp file ?",
        "Do you know what is jnlp file ?",
        "Tell me what is jnlp file ?",
        "Do you know anything about what is jnlp file ?",
        "Tell me something about what is jnlp file ?",
        "Any idea what is jnlp file ?",
		"successful tasks",
		"Give me my successful tasks",
        "Show me my successful tasks",
        "Do you know my successful tasks",
        "Tell me all my successful tasks",
        "Do you know anything about successful tasks",
        "Tell me something about my successful tasks",
        "Any idea about my successful tasks",
		"failed tasks",
		"Give me my failed tasks",
        "Show me my failed tasks",
        "Do you know my failed tasks",
        "Tell me all my failed tasks",
        "Do you know anything about failed tasks",
        "Tell me something about my failed tasks",
        "Any idea about my failed tasks",
		"finish with error tasks",
		"Give me my finish with error tasks",
        "Show me my finish with error tasks",
        "Do you know my finish with error tasks",
        "Tell me all my finish with error tasks",
        "Do you know anything about finish with error tasks",
        "Tell me something about my finish with error tasks",
        "Any idea about my finish with error tasks",
		"untriggered tasks",
		"Give me my untriggered tasks",
        "Show me my untriggered tasks",
        "Do you know my untriggered tasks",
        "Tell me all my untriggered tasks",
        "Do you know anything about untriggered tasks",
        "Tell me something about my untriggered tasks",
        "Any idea about my untriggered tasks",
		"not triggered tasks",
		"Give me my not triggered tasks",
        "Show me my not triggered tasks",
        "Do you know my not triggered tasks",
        "Tell me all my not triggered tasks",
        "Do you know anything about not triggered tasks",
        "Tell me something about my not triggered tasks",
        "Any idea about my not triggered tasks",
		"Show me some Successful Tasks",
		"Show me some failed tasks",
		"Show me some finish with errors tasks",
		"Show me some untriggered tasks",
        "Show me the status of BALANCE_1",
        "Tell me the status of task",
        "help me with the status of task",
        "Do you know the status of task",
        "Give me the status task",
        "Provide the status of task",
        "Show me task valuation time for 1234",
        "Tell me about my task valuation time",
        "Do you know task valuation of task 1334",
        "valuation of task 2389",
        "show valuation of task 7675",
	"Have all of my reports been generated today?",
        "Give me status on all my reports?",
        "Tell me status of all my reports?",
        "status on all my reports",
        "Help me with status of all my reports"
      ]
    }

]
}
