{
  "status": "success",
  "data": [
    {
      "source": "facebook",
      "title": "BASF",
      "short_description": "BASF has launched a new production facility in Taiwan to meet market demands for #Infinergy® E-TPU. Thanks to its unique blend of properties: high rebound, low density, durability over a wide temperature range, chemical resistance and low weight, this BASF innovation is widely used in the transportation, furniture, construction and sports equipment.",
	  "description": "BASF has launched a new production facility in Taiwan to meet market demands for #Infinergy® E-TPU. Thanks to its unique blend of properties: high rebound, low density, durability over a wide temperature range, chemical resistance and low weight, this BASF innovation is widely used in the transportation, furniture, construction and sports equipment.",
      "created_ago": "7 hours ago"
    },
    {
      "source": "custom",
      "title": "New production facility in Taiwan to meet market demands for world’s first Expanded Thermoplastic Polyurethane",
	  "short_description":"BASF, inventor of the world’s first Expanded Thermoplastic Polyurethane (E-TPU) Infinergy®, has launched a new Infinergy production facility at its Changhua manufacturing site in Taiwan. The expanded capacity will meet growing demand for the revolutionary material solution across a variety of...",
      "description": "<li><b>New facility will support growing demand for BASF’s Infinergy<sup>®</sup> E-TPU from multiple industries </b></li><li><b>Expanded global footprint to better serve customers in Asia Pacific</b></li></ul><p>Changhua, Taiwan – September 21, 2018 – BASF, inventor of the world’s first Expanded Thermoplastic Polyurethane (E-TPU) Infinergy<sup>®</sup>, has launched a new Infinergy production facility at its Changhua manufacturing site in Taiwan. The expanded capacity will meet growing demand for the revolutionary material solution across a variety of applications and industries.</p><p>'The Changhua production site will play a key role in helping us to meet the rising demand for E-TPU,' said Jens Dierssen, Head of Global Business Management Infinergy, BASF. 'With the new production facility, we are expanding our global footprint to better serve customers within the Asia Pacific region.'</p><p>'This investment reflects our commitment to the market, providing efficient production, timely qualification process to meet the growing market demands and customer needs. We are now even closer to the market and our customers, ' added Kin Wah Chay, Managing Director of BASF Taiwan.</p><p>The closed-cell, elastic particle foam has a unique blend of properties, such as high rebound, low density, durability over a wide temperature range, chemical resistance and low weight. This innovation is widely used in the transportation, furniture, construction and sports equipment, such as a bicycle saddle created by Ergon, a cycling innovation company based in Koblenz, Germany.</p><p>Ergon’s bicycle saddles are comprised of two shells functioning in isolation from each other in a sandwich construction, held in a floating arrangement by the high-performance elastomer damper made of Infinergy.</p><p>In a three-wheeled concept vehicle, 05GEN from Yamaha Motor Co., Ltd., BASF’s Infinergy was used in the tires to enhance the overall riding experience, and its characteristic cellular structure contributed to its striking design.</p><p>The material has also been adopted in construction, providing a safer and improved sporting experience on running track and playing fields, owing to the outstanding cushioning effect of the E-TPU particles.</p><p>Receive the latest press releases from BASF via WhatsApp on your smartphone or tablet. Register for our news service at <a href='http://www.basf.com/whatsapp-news' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;basf.com/whatsapp-news</a></p><p><b>About BASF’s Performance Materials division</b></p><p>BASF’s Performance Materials division encompasses the entire materials know-how of BASF regarding innovative, customized plastics under one roof. Globally active in four major industry sectors – transportation, construction, industrial applications and consumer goods – the division has a strong portfolio of products and services combined with a deep understanding of application-oriented system solutions. Key drivers of profitability and growth are our close collaboration with customers and a clear focus on solutions. Strong capabilities in R&amp;D provide the basis to develop innovative products and applications. In 2017, the Performance Materials division achieved global sales of € 7.7 bn. More information online: <a href='http://www.performance-materials.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.performance-materials.basf.com</a></p><p><b>About BASF</b></p><p>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. More than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at: <a href='http://www.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a></p>",
      "created_ago": "8 hours ago"
    },
    {
      "source": "facebook",
      "title": "BASF",
	  "short_description":"Congratulations to BASF Chongqing MDI site for 5 million safe working hours. Ensuring safe working conditions is a commitment enshrined in BASF’s strategy, to protect our employees, contractors and neighbors.",
      "description": "<p>Chongqing, China – September 15, 2018 – Sanjeev Gandhi, member of the Board of Executive Directors, BASF SE, responsible for Asia Pacific, presents a BASF safety helmet to Li Dianxun, Vice-Mayor of Chongqing, during this year’s meeting of the Chongqing Mayor’s International Advisory Council.&nbsp; The gift honors five million safe working hours of methylene diphenyl di-isocyanate (MDI) production at the BASF site in Chongqing.</p><p><b>About BASF in Greater China</b></p><p>BASF has been a committed partner to Greater China since 1885. With investments in Shanghai, Nanjing and Chongqing, BASF is a major foreign investor in China’s chemical industry, and maintains the Innovation Campus Shanghai as a global and regional research and development hub.&nbsp; BASF posted sales of €7.3 billion in 2017 to customers in Greater China, and employed 8,982 people as of the end of that year. For further information, please visit www.basf.com/cn.</p><p><b>About BASF</b></p><p>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at <a href='http://www.basf.com/' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a>.</p>",
	  "created_ago": "4 days ago"
    },
    {
      "source": "facebook",
      "title": "BASF",
	  "short_description":"To help children explore the world of chemistry, BASF unveiled the Virtual Chemical Reactions Interactive Touch Table at the Philippines’ leading science museum, The Mind Museum. BASF is launching a series of science...",
      "description": "<ul><li><b>BASF inaugurates Virtual Chemical Reactions Interactive Touch Table at The Mind Museum </b></li><li><b>Employees donate 'bottle brick' building materials made from waste, in exchange for kids’ science book donation</b></li></ul><p>Manila, Philippines – September 7, 2018 – BASF is celebrating its 55th year in the Philippines with a series of projects focusing on science education.</p><p>Together with The Mind Museum, the Philippines’ leading science museum, BASF unveiled the Virtual Chemical Reactions Interactive Touch Table at the Atom Gallery of the museum. The only one of its kind in the country, the Virtual Chemical Reactions Interactive Touch Table, donated by BASF, uses digital simulations, audio, and colorful animations to help children explore the world of chemistry, so that they can observe the chemical reactions between various chemical substances in a completely safe and interactive environment. A virtual tutor will also guide children to understand the element’s features and explain the chemistry theory behind it.</p><p>Maribel Garcia, Curator of The Mind Museum said, 'The Mind Museum and BASF will work closely to create new opportunities for the public, especially young people, to nurture their natural curiosity and ignite an interest in science from an early age.'</p><p>Ronald Mercado, Managing Director of BASF Philippines said, 'To celebrate 55 years of growth together with the Philippines, we will continue to strengthen our commitment to science education and sustainability in the country. In the future, children will face challenges that my generation has not even imagined. At BASF, we believe that science is the tool that would aid them in solving these challenges.'</p><p>BASF will hold its Kids’ Lab at the science museum in October and participants will get a chance to play with and learn about chemistry through the interactive touch table. Every year, the Mind Museum hosts educational field trips for an average of 250,000 school children in the Philippines.</p><p>BASF employees led another anniversary project with the donation of bottle bricks that will be exchanged for science books about water conservation. The books will be donated to local public schools and NGOs and bottle bricks will be used as alternative fillers in building walls and benches.</p><p>A bottle brick, also known as an ecobrick, is a reusable building block created by packing clean and dry used plastic into a plastic bottle to a set density. Bottle bricks can be used to build furniture, gardens, and other structures.</p><p>'Bottle bricking has been gaining attention locally and across the globe, as it presents a practical solution to how people minimize their contribution to plastic pollution, particularly as it tends to end up in the ocean. Through our corporate citizenship activities, we aim to create sustainable impact on our society,' said Mercado. BASF’s non-profit activities in Philippines are dedicated to supporting the United Nations Strategic Development Goal #4, 'Quality Education'.</p><p><b>About BASF in the Philippines</b><br><span style=''>In the Philippines, BASF has been enabling manufacturers in various industries since 1963. Today, BASF Philippines, Inc. is a leading supplier of chemicals for industries including construction and coatings, automotive, health and nutrition, personal and home care, chemicals and plastics, and agriculture. BASF also operates an agricultural research station which conducts research, laboratory studies and field testing of novel technologies as part of BASF’s global research effort in the field of agricultural solutions. In 2017, BASF posted sales to customers in Philippines of approximately €119 million, and employed 88 people as of the end of the year. Further information on BASF in the Philippines is available at </span><a href='http://www.basf.com/ph' class='externalLink' style='' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com/ph</a><span style=''>.</span></p><p><b>About BASF</b><br><span style=''>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at </span><a href='http://www.basf.com' class='externalLink' style='' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a><span style=''>.&nbsp;</span></p>",
      "created_ago": "2 weeks ago"
    },
    {
      "source": "twitter",
      "title": "BASF Asia Pacific",
	  "short_description":"Hi pradipshitole01 -- please note this account is retired. You can follow/mention/reach us at BASF. Thanks!",
      "description": "Hi pradipshitole01 -- please note this account is retired. You can follow/mention/reach us at BASF. Thanks!",
      "created_ago": "2 weeks ago"
    },
    {
      "source": "facebook",
      "title": "BASF",
	  "short_description": "With consumers placing a high emphasis on health and hygiene, single-use kitchen wipes are growing in popularity. A meltblown non-woven fabric maker in Korea has launched new single-use scrub wipes, using...",
      "description": "<ul><li><b>Irgatec<sup>®</sup> improves air permeability as well as higher long-term thermal stability of PP meltblown non-woven materials</b></li></ul><p>Hong Kong – September 6, 2018 – Korea Nonwoven Technology Co., Ltd, a polypropylene (PP) meltblown non-woven fabric maker in South Korea, has launched new single-use scrub wipes using BASF’s rheology-modifying additive Irgatec<sup>®</sup>. The wipes can offer a more hygienic alternative to conventional materials.</p><p>By adopting BASF’s solution in their production, Korea Nonwoven Technology (KNT) has been able to develop a new meltblown non-woven grade which has better barrier and mechanical properties than conventional meltblown grades. This new meltblown grade was initially launched for filter applications and now KNT is developing it for further business growth. One such area is single-use scrub wipes.</p><p>With consumers placing a high emphasis on health and hygiene, single-use scrub wipes for indoor and outdoor use are growing in popularity. The single filaments possible with Irgatec are thinner, stronger and more flexible than those of existing technology. The resulting stronger fabric improves cleaning efficiency compared to existing materials like paper, spunbond non-woven and conventional meltblown grades.</p><p>'Our additive enables customers to produce high-end non-woven fabrics with unique properties economically,' said Hermann Althoff, Senior Vice President, Performance Chemicals Asia Pacific. 'The key benefits for non-wovens made from Irgatec include enhanced barrier properties, as well as improved mechanical properties in meltblown fabrics and cost savings due to flexibility in raw materials.'</p><p>'With BASF’s rheology-modifying additive we were able to launch a new meltblown grade of high quality single-use scrub wipes which are better in terms of strength, elasticity and thickness,' said Mr. Kwang-il Kwon, CEO of KNT. 'This has made us a leader in the Korean market.'</p><p>Meltblowing is a one-step process in which streams of molten polymer are subjected to hot, high-velocity air to produce a web of microfibers. The ability to form a web directly from a molten polymer without controlled stretching gives meltblown technology a distinct cost advantage over other systems. These fine fibers provide an exceptionally high surface area, suitable for (or: which benefits) multiple applications.</p><p>Irgatec allows a controlled rheological modification of the PP for nonwoven applications. It is highly efficient at extrusion temperatures exceeding 250 °C and therefore particularly suited for PP meltblown applications. Such fabrics do not irritate the skin and, therefore, are suitable for many hygiene products, such as diapers, cleaning wipes, filtration products, and medical applications.</p><p><b>About BASF Plastic Additives</b></p><p>BASF is a leading supplier, manufacturer and innovation partner of plastic additives. Its comprehensive and innovative product portfolio includes stabilizers which provide ease in processing, heat and light resistance to a variety of polymers and applications including molded articles, films, fibers, sheets and extruded profiles. More information about plastic additives: <a href='http://www.plasticadditives.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.plasticadditives.basf.com</a>.</p><p><b>About BASF</b></p><p>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at <a href='http://www.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a>. &nbsp;</p>",
      "created_ago": "2 weeks ago"
    },
    {
      "source": "custom",
      "title": "BASF helps meltblown non-woven fabric manufacturer in Korea branch out into new area of business",
	  "short_description": "Korea Nonwoven Technology Co., Ltd, a polypropylene (PP) meltblown non-woven fabric maker in South Korea, has launched new single-use scrub wipes using BASF’s rheology-modifying additive Irgatec®. The wipes can offer a more hygienic alternative to conventional materials.",
      "description": "<ul><li><b>Irgatec<sup>®</sup> improves air permeability as well as higher long-term thermal stability of PP meltblown non-woven materials</b></li></ul><p>Hong Kong – September 6, 2018 – Korea Nonwoven Technology Co., Ltd, a polypropylene (PP) meltblown non-woven fabric maker in South Korea, has launched new single-use scrub wipes using BASF’s rheology-modifying additive Irgatec<sup>®</sup>. The wipes can offer a more hygienic alternative to conventional materials.</p><p>By adopting BASF’s solution in their production, Korea Nonwoven Technology (KNT) has been able to develop a new meltblown non-woven grade which has better barrier and mechanical properties than conventional meltblown grades. This new meltblown grade was initially launched for filter applications and now KNT is developing it for further business growth. One such area is single-use scrub wipes.</p><p>With consumers placing a high emphasis on health and hygiene, single-use scrub wipes for indoor and outdoor use are growing in popularity. The single filaments possible with Irgatec are thinner, stronger and more flexible than those of existing technology. The resulting stronger fabric improves cleaning efficiency compared to existing materials like paper, spunbond non-woven and conventional meltblown grades.</p><p>'Our additive enables customers to produce high-end non-woven fabrics with unique properties economically,' said Hermann Althoff, Senior Vice President, Performance Chemicals Asia Pacific. 'The key benefits for non-wovens made from Irgatec include enhanced barrier properties, as well as improved mechanical properties in meltblown fabrics and cost savings due to flexibility in raw materials.'</p><p>'With BASF’s rheology-modifying additive we were able to launch a new meltblown grade of high quality single-use scrub wipes which are better in terms of strength, elasticity and thickness,' said Mr. Kwang-il Kwon, CEO of KNT. 'This has made us a leader in the Korean market.'</p><p>Meltblowing is a one-step process in which streams of molten polymer are subjected to hot, high-velocity air to produce a web of microfibers. The ability to form a web directly from a molten polymer without controlled stretching gives meltblown technology a distinct cost advantage over other systems. These fine fibers provide an exceptionally high surface area, suitable for (or: which benefits) multiple applications.</p><p>Irgatec allows a controlled rheological modification of the PP for nonwoven applications. It is highly efficient at extrusion temperatures exceeding 250 °C and therefore particularly suited for PP meltblown applications. Such fabrics do not irritate the skin and, therefore, are suitable for many hygiene products, such as diapers, cleaning wipes, filtration products, and medical applications.</p><p><b>About BASF Plastic Additives</b></p><p>BASF is a leading supplier, manufacturer and innovation partner of plastic additives. Its comprehensive and innovative product portfolio includes stabilizers which provide ease in processing, heat and light resistance to a variety of polymers and applications including molded articles, films, fibers, sheets and extruded profiles. More information about plastic additives: <a href='http://www.plasticadditives.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.plasticadditives.basf.com</a>.</p><p><b>About BASF</b></p><p>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at <a href='http://www.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a>. &nbsp;</p>",
	  "created_ago": "2 weeks ago"
    },
    {
      "source": "custom",
      "title": "BASF appoints Ketan Joshi to lead Petrochemicals in Asia Pacific",
      "short_description": "BASF has appointed Ketan Joshi to lead its Petrochemicals business unit in Asia Pacific, based in Hong Kong, effective September 1, 2018.",
	  "description":"<p>Hong Kong – September 4, 2018 – BASF has appointed Ketan Joshi to lead its Petrochemicals business unit in Asia Pacific, based in Hong Kong, effective September 1, 2018.</p><p>Joshi started his career with BASF in 2006 in the R&amp;D department. He then held various management positions in Corporate Strategy, as well as in Product Management and Global Strategy for the Intermediates Division. He was most recently Head of Strategic Marketing and Projects, Intermediates Asia Pacific. As Vice President, Petrochemicals Asia Pacific, he will focus on expanding the business and supporting BASF’s customers and partners in the region.</p><p><b>About BASF</b></p><p>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at <a href='http://www.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a>.</p>",
      "created_ago": "2 weeks ago"
    },
    {
      "source": "twitter",
      "title": "BASF Asia Pacific",
	  "short_description":"Hi amolupare3 -- please note this account is retired. You can follow/mention/reach us at BASF. Thanks!.",
      "description": "Hi amolupare3 -- please note this account is retired. You can follow/mention/reach us at BASF. Thanks!.",
      "created_ago": "2 weeks ago"
    },
    {
      "source": "custom",
      "title": "IIVS Collaborates with BASF and Givaudan to Validate a Non-animal Test for Regulatory Submissions",
	  "short_description":"The Institute for In Vitro Sciences (IIVS), with an established track record in the validation of alternatives to animal testing, is teaming up with BASF and Givaudan to validate an improved skin sensitization reactivity method to address the needs of toxicologists and regulators.",
      "description": "<p>GAITHERSBURG, MD –August 28– The Institute for In Vitro Sciences (IIVS), with an established track record in the validation of alternatives to animal testing, is teaming up with BASF and Givaudan to validate an improved skin sensitization reactivity method to address the needs of toxicologists and regulators.</p><p>Scientists at BASF and Givaudan have developed the Kinetic Direct Peptide Reactivity Assay (Kinetic DPRA), a non-animal test to predict allergic reactions in the skin known as sensitization. Three other non-animal sensitizer tests have been internationally accepted. However, the Kinetic DPRA has the potential to go beyond a yes/no answer and predict the potency of a sensitizer, which is required by some regulatory agencies. Until now the only way to predict potency classifications was through animal testing.</p><p>'Being able to determine potency with minor modifications of the well-established and routinely used DPRA method was highly attractive to us,' stated Dr. Robert Landsiedel, Vice President, Experimental Toxicology and Ecology, BASF. 'Once validated, we hope that the Kinetic DPRA will obviate the need for further animal testing to determine potency of chemicals. We are pleased that IIVS is joining our efforts to prove the validity of the method.'</p><p>'Assessing potency of skin sensitizers is an essential step in risk assessment to determine safe use levels, and we have shown that kinetic data are key for this' indicates Dr. Andreas Natsch, Head of in vitro molecular screening at Givaudan.</p><p>The validation project, designed by BASF and Givaudan, will be conducted over the course of 2018 and, pending a successful outcome, will be submitted to the Organization for Economic Cooperation and Development (OECD) in 2019.</p><p>'We are pleased to be working again with BASF and Givaudan to validate a technology that will be available for many industry sectors and applications,' said Erin Hill, President, IIVS. 'Our ability to participate in such programs is through the generous support of our contributors.' Other participating laboratories include The Procter &amp; Gamble Company (developer of the original DPRA), Charles River and the Czech National Institute of Public health.</p><p><b>About the Institute for In Vitro Sciences (IIVS)</b><br>IIVS is a non-profit organization wholly dedicated to the promotion of rapid and innovative non-animal test methods. Founded in 1997, IIVS is recognized as a leading provider of in vitro testing in support of toxicological safety evaluations. Rigorous scientific programs coupled with educational and outreach initiatives have established IIVS as a global leader in the advancement of alternatives to animal testing. For more information, visit us at <a href='http://www.iivs.org' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.iivs.org</a>.</p><p><b>About BASF</b><br>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at&nbsp;<a href='http://www.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a>.</p><p><b>About Givaudan</b><br>Givaudan is the global leader in the creation of flavours and fragrances. In close collaboration with food, beverage, consumer product and fragrance partners, Givaudan develops tastes and scents that delight consumers the world over. With a passion to understand consumers’ preferences and a relentless drive to innovate, Givaudan is at the forefront of creating flavours and fragrances that ‘engage your senses’. The Company achieved sales of CHF 5.1 billion in 2017. Headquartered in Switzerland with local presence in over 100 locations, the Company has more than 11,100 employees worldwide. Givaudan invites you to discover more at <a href='http://www.givaudan.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.givaudan.com</a>.<br><br>P-18-298</p>",
      "created_ago": "2 weeks ago"
    },
    {
      "source": "custom",
      "title": "BASF",
	  "short_description":"Farmers in Asia are eager to adopt new technologies to make farming more efficient and profitable. BASF will launch two new smartphone apps, xarvio™ SCOUTING and FIELD MANAGER, to help growers monitor...",
      "description": "<ul><li><b>xarvio™ SCOUTING and FIELD MANAGER apps to be launched for use by farmers in Asia</b></li><li><b>Apps help growers identify weeds and diseases, analyze plant health, and optimize crop protection application timing</b></li><li><b>Showcased at Agritechnica Asia, August 22-24, booth E18, Bangkok International Trade &amp; Exhibition Centre (BITEC)</b></li></ul><p>Bangkok, Thailand – Two new smartphone apps from xarvio™ Digital Farming Solutions will soon allow farmers to monitor the health of their crops and get recommendations for the application and dosage of crop protection products, helping them be more efficient and profitable. The forthcoming launch of the new apps across Asia will provide the region’s growers valuable new tools for improving crop yield and quality via digital technology.</p><p>'Farmers in Asia are eager to adopt new methods. With policies such as Thailand 4.0 helping to drive changes in the agricultural sector, we are excited to be preparing to launch these new tools. With these digital technologies, growers can improve crop quality and increase yields', said Andree-Georg Girg, Global Head Commercial Operations for Digital Farming.</p><p>The first app, xarvio SCOUTING, helps farmers regularly inspect their fields and monitor plant health and signs of potential pest infestations using an advanced algorithm for problem identification. Using just a photo from smartphone, xarvio SCOUTING can help farmers identify weeds, recognize crop diseases, analyze leaf damage and measure the nitrogen uptake of crops. Armed with this information, farmers can more accurately diagnose issues and select the appropriate treatments.</p><p>In addition, the xarvio FIELD MANAGER app uses imaging and sensor technology from satellites and other data to monitor the status of their fields, and helps farmers understand potential risks for infestations and provides spray timing and dosage suggestions.</p><p>To give a preview of the new tools, both xarvio apps will be showcased at the Agritechnica Asia, August 22-24, Bangkok International Trade &amp; Exhibition Centre (BITEC) - booth E18.</p><p>The official launch of xarvio SCOUTING in Asia is planned for later this year, with FIELD MANAGER to follow in 2019. The app currently supports crops such as corn, soy, potatoes, with expanded functionality for other crops such as rice and sugarcane coming soon. Asian language support is also planned.</p><p>A new addition to BASF’s agricultural solutions portfolio, the xarvio Digital Farming Solutions platform brings together world-class expertise in digital technology, data analysis and artificial intelligence to develop tools that help grower optimize their operations.</p><p><b>About BASF’s Agricultural Solutions division</b></p><p>With a rapidly growing population, the world is increasingly dependent on our ability to develop and maintain sustainable agriculture and healthy environments. Working with farmers, agricultural professionals, pest management experts and others, it is our role to help make this possible. That’s why we invest in a strong R&amp;D pipeline and broad portfolio, including seeds and traits, chemical and biological crop protection, soil management, plant health, pest control and digital farming. With expert teams in the lab, field, office and in production, we connect innovative thinking and down-to-earth action to create real world ideas that work – for farmers, society and the planet. In 2017, our division generated sales of €5.7 billion. For more information, please visit <a class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.agriculture.basf.com</a> or any of our social media channels.</p><p><b>About BASF</b></p><p>At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. The more than 115,000 employees in the BASF Group work on contributing to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio is organized into five segments: Chemicals, Performance Products, Functional Materials &amp; Solutions, Agricultural Solutions and Oil &amp; Gas. BASF generated sales of €64.5 billion in 2017. BASF shares are traded on the stock exchanges in Frankfurt (BAS), London (BFA) and Zurich (BAS). Further information at <a href='http://www.basf.com' class='externalLink' target='_blank'><i class='icon icon-external-link'></i>&nbsp;www.basf.com</a>.</p><dl><dt class='text-bold'>Teerarat Veetlopchaiyavuth</dt><dd class='job-function'>Corporate Affairs</dd><dd class='address'>Bangkok</dd><dd class='spacer'></dd><dd><i class='icon icon-typ-1 icon-phone' title='Phone'></i><a href='tel:+66 2 624 1999 ext 1822'>+66 2 624 1999 ext 1822</a></dd><dd><i class='icon icon-typ-1 icon-fax' title='Fax'></i>+66 2 664 9221</dd><dd><i class='icon icon-typ-1 icon-mobile' title='Cell phone'></i><a href='tel:+66 81 836 3524 '>+66 81 836 3524</a></dd><dd><a data-wtid='WT.mailto|WT.dl' data-wtvalue='teerarat.veetlopchaiyavuth@basf.com|23' href='mailto:teerarat.veetlopchaiyavuth@basf.com'><i class='icon icon-typ-1 icon-mail'></i>Send Mail</a></dd></dl>",
      "created_ago": "2 weeks ago"
    }
  ]
}